# Data Manipulation

* Pandas is built on top pf two essential Python packages, NumPy and Matplotlib. NumPy pfovides multidimensional array objects for easy data manipulation that pandas uses to store data, and Matplotlib has powerful data visualization capabilities that pandas takes advantage of.

In [2]:
import pandas as pd

In [1]:
path = r"C:\Users\Alysson\Documents\GitHub\Pandas-in-Python\database.xlsx"

data = pd.read_excel(path)
data.head()

NameError: name 'pd' is not defined

### Here are a few basic commands to check the data

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       5 non-null      object
 1   breed      5 non-null      object
 2   color      5 non-null      object
 3   height_cm  5 non-null      int64
 4   weight_kg  5 non-null      int64
 5   age        5 non-null      int64
dtypes: int64(3), object(3)
memory usage: 372.0+ bytes

In [5]:
data.shape

(5, 6)

In [6]:
data.describe()

       height_cm  weight_kg       age
count   5.000000   5.000000  5.000000
mean   50.000000  24.000000  4.400000
std     7.348469   3.162278  1.140175
min    43.000000  21.000000  3.000000
25%    43.000000  22.000000  4.000000
50%    49.000000  23.000000  4.000000
75%    56.000000  25.000000  5.000000
max    59.000000  29.000000  6.000000

In [7]:
data.values

array([['Pa√ßoca', 'Labrador', 'Brown', 56, 25, 5],
       ['Ivo', 'Poodle', 'Black', 43, 22, 4],
       ['Lola', 'Schnauzer', 'Gray', 49, 23, 4],
       ['Maracatu', 'King Cavalier', 'Brown', 43, 21, 3],
       ['Chantal', 'Labrador', 'Black', 59, 29, 6]], dtype=object)

In [8]:
data.columns

Index(['name', 'breed', 'color', 'height_cm', 'weight_kg', 'age'], dtype='object')

In [9]:
data.index

RangeIndex(start=0, stop=5, step=1)

### Sorting and Subsetting

It provides various functions for sorting and subsetting data.

In [11]:
data.sort_values('name')

       name          breed  color  height_cm  weight_kg  age
4   Chantal       Labrador  Black         59         29    6
1       Ivo         Poodle  Black         43         22    4
2      Lola      Schnauzer   Gray         49         23    4
3  Maracatu  King Cavalier  Brown         43         21    3
0    Pa√ßoca       Labrador  Brown         56         25    5

In [13]:
data.sort_values('name', ascending = False)

       name          breed  color  height_cm  weight_kg  age
0    Pa√ßoca       Labrador  Brown         56         25    5
3  Maracatu  King Cavalier  Brown         43         21    3
2      Lola      Schnauzer   Gray         49         23    4
1       Ivo         Poodle  Black         43         22    4
4   Chantal       Labrador  Black         59         29    6

In [14]:
data.sort_values(['height_cm','weight_kg'], ascending = [False , True])

       name          breed  color  height_cm  weight_kg  age
4   Chantal       Labrador  Black         59         29    6
0    Pa√ßoca       Labrador  Brown         56         25    5
2      Lola      Schnauzer   Gray         49         23    4
3  Maracatu  King Cavalier  Brown         43         21    3
1       Ivo         Poodle  Black         43         22    4

In [18]:
data['name']

0      Pa√ßoca
1         Ivo
2        Lola
3    Maracatu
4     Chantal
Name: name, dtype: object

In [15]:
data[['height_cm','weight_kg']]

   height_cm  weight_kg
0         56         25
1         43         22
2         49         23
3         43         21
4         59         29

In [24]:
data['height_cm'] > 50

0     True
1    False
2    False
3    False
4     True
Name: height_cm, dtype: bool

In [23]:
data[data['height_cm'] > 50]

      name     breed  color  height_cm  weight_kg  age
0   Pa√ßoca  Labrador  Brown         56         25    5
4  Chantal  Labrador  Black         59         29    6

In [26]:
data[data['breed'] == 'Labrador']

      name     breed  color  height_cm  weight_kg  age
0   Pa√ßoca  Labrador  Brown         56         25    5
4  Chantal  Labrador  Black         59         29    6

In [29]:
data[(data['breed'] == 'Labrador') & (data['color'] == 'Brown')]

     name     breed  color  height_cm  weight_kg  age
0  Pa√ßoca  Labrador  Brown         56         25    5

In [32]:
is_black_or_brown = data['color'].isin(['Black','Brown'])
data[is_black_or_brown]

       name          breed  color  height_cm  weight_kg  age
0    Pa√ßoca       Labrador  Brown         56         25    5
1       Ivo         Poodle  Black         43         22    4
3  Maracatu  King Cavalier  Brown         43         21    3
4   Chantal       Labrador  Black         59         29    6

### New columns

How to create new columns with pandas

In [40]:
data['bmi']=data['weight_kg']/1000*(data['height_cm'])**2
print(data)

       name          breed  color  height_cm  weight_kg  age      bmi
0    Pa√ßoca       Labrador  Brown         56         25    5   78.400
1       Ivo         Poodle  Black         43         22    4   40.678
2      Lola      Schnauzer   Gray         49         23    4   55.223
3  Maracatu  King Cavalier  Brown         43         21    3   38.829
4   Chantal       Labrador  Black         59         29    6  100.949